<h1 style="text-align: right;"><span style="background-color: #ccffff;"><img style="float: left;" src="https://correos.saltillo.tecnm.mx/images/its.png" alt="its logo" width="191" height="176" /></span><img src="https://upload.wikimedia.org/wikipedia/commons/thumb/d/d4/Logo-TecNM-2017.png/640px-Logo-TecNM-2017.png" alt="" width="251" height="155" /></h1>
<h4 style="text-align: right;"><span style="color: #99cc00;">Arquitectura de computadoras</span></h4>
<h4 style="text-align: right;"><span style="color: #99cc00;">Ximena Carolina Alvarez moreno</span></h4>
<h4 style="text-align: right;"><span style="color: #99cc00;"><a style="color: #99cc00;" href="mailto:ximenalvarez29.m@gmail.com">ximenalvarez29.m@gmail.com</a></span></h4>
<h4 style="text-align: right;"><span style="color: #99cc00;">17:00 HRS</span></h4>

<h1 style="text-align: center;">UNIDAD 3&nbsp;</h1>
<h2>3.1 Chip Set</h2>
<p style="text-align: justify;">Un chipset es el conjunto de circuitos integrados dise&ntilde;ados con base en la arquitectura de un procesador (en algunos casos, dise&ntilde;ados como parte integral de esa arquitectura), permitiendo que ese tipo de procesadores funcionen en una placa base. Sirven de puente de comunicaci&oacute;n con el resto de componentes de la placa, como son la memoria, las tarjetas de expansi&oacute;n, los puertos USB, rat&oacute;n, teclado, etc.</p>
<p style="text-align: justify;">Las placas base modernas suelen incluir dos integrados, denominados puente norte y puente sur, y suelen ser los circuitos</p>
<p style="text-align: justify;">integrados m&aacute;s grandes despu&eacute;s de la GPU y el microprocesador.</p>
<p style="text-align: justify;">Las &uacute;ltimas placa base carecen de puente norte, ya que los procesadores de &uacute;ltima generaci&oacute;n lo llevan integrado.</p>
<p style="text-align: justify;">&nbsp;</p>
<p style="text-align: justify;"><span style="background-color: #999999;"><strong><span class="textoGral">Historia.</span></strong></span></p>
<p style="text-align: justify;">Desde los comienzos de la historia la fabricaci&oacute;n de los primeros microprocesadores, se pens&oacute; en un conjunto de integrados de soporte, de hecho, el primer microprocesador de la historia, el Intel 4004 formaba parte de un conjunto de integrados numerados 4001, 4002 y 4003 que ten&iacute;an todos una apariencia f&iacute;sica similar y que formaban la base de un sistema de c&oacute;mputo cualquiera.</p>
<p style="text-align: justify;">Mientras que otras plataformas usaban muy variadas combinaciones de chips de prop&oacute;sito general, los empleados en el Commodore 64 y la Familia Atari de 8 bits, incluso sus CPUs, sol&iacute;an ser dise&ntilde;os especializados para la plataforma, que no se encontraban en otros equipos electr&oacute;nicos, por lo que se les comenz&oacute; a llamar chipsets.</p>
<p style="text-align: justify;">Este t&eacute;rmino se generaliz&oacute; en la siguiente generaci&oacute;n de computadores dom&eacute;sticos: el Commodore Amiga y el Atari ST son los equipos m&aacute;s potentes de los a&ntilde;os 1990, y ambos ten&iacute;an multitud de chips auxiliares que se encargaban del manejo de la memoria, el sonido, los gr&aacute;ficos o el control de unidades de almacenamiento masivo dejando a la CPU libre para otras tareas. En el Amiga sobre todo se diferenciaban las generaciones por el chipset utilizado en cada una.</p>
<p><img style="display: block; margin-left: auto; margin-right: auto;" src="http://www.alegsa.com.ar/Diccionario/Imagenes/placa_madre_arquitectura.png" alt="Chipset" width="284" height="414" /></p>
<p style="text-align: justify;"><span style="background-color: #ffcc99;"><strong><span class="textoGral">Funcionamiento</span></strong></span></p>
<p style="text-align: justify;">El chipset es el que hace posible que la placa base funcione como eje del sistema, dando soporte a varios componentes e interconect&aacute;ndolos de forma que se comuniquen entre ellos haciendo uso de diversos buses. Es uno de los pocos elementos que tiene conexi&oacute;n directa con el procesador, gestiona la mayor parte de la informaci&oacute;n que entra y sale por el bus principal del procesador, del sistema de v&iacute;deo y muchas veces de la memoria RAM.</p>
<p style="text-align: justify;">En el caso de los computadores PC, es un esquema de arquitectura abierta que establece modularidad: el chipset debe tener interfaces est&aacute;ndar para los dem&aacute;s dispositivos. Esto permite escoger entre varios dispositivos est&aacute;ndar, por ejemplo, en el caso de los buses de expansi&oacute;n, algunas tarjetas madre pueden tener bus PCI-Express y soportar diversos tipos de tarjetas de distintos anchos de bus (1x, 8x, 16x).</p>
<p style="text-align: justify;">La terminolog&iacute;a de los integrados ha cambiado desde que se cre&oacute; el concepto del chip-set a principio de los a&ntilde;os 1990, pero todav&iacute;a existe equivalencia haciendo algunas aclaraciones:</p>
<ul style="text-align: justify;">
<li><strong>Puente norte:</strong>&nbsp;northbridge, MCH (memory controller hub) o GMCH (graphic MCH), se usa como puente de enlace entre el microprocesador y la memoria. Controla las funciones de acceso hacia y entre el microprocesador, la memoria RAM, el puerto gr&aacute;fico AGP o el PCI-Express de gr&aacute;ficos, y las comunicaciones con el puente sur. Al principio ten&iacute;a tambi&eacute;n el control de PCI, pero esa funcionalidad ha pasado al puente sur.</li>
<li id="cpu"><strong>Puente sur:&nbsp;</strong>southbridge o ICH (input controller hub), controla los dispositivos asociados como son la controladora de discos IDE, puertos USB, FireWire, SATA, RAID, ranuras PCI, ranura AMR, ranura CNR, puertos infrarrojos, disquetera, LAN, PCI-Express 1x y una larga lista de todos los elementos que podamos imaginar integrados en la placa madre. Es el encargado de comunicar el procesador con el resto de los perif&eacute;ricos.</li>
</ul>
<h3 style="text-align: justify;"><span class="subtitulo" style="background-color: #ffcc99;">3.1.1 Unidad Central de Procesamiento (CPU).</span></h3>
<p style="text-align: justify;">La unidad central de procesamiento (siglas en ingl&eacute;s Central Processing Unit) es el hardware dentro de una computadora u otros dispositivos programables. Su trabajo es interpretar las instrucciones de un programa inform&aacute;tico mediante la realizaci&oacute;n de las operaciones b&aacute;sicas aritm&eacute;ticas, l&oacute;gicas y externas (provenientes de la unidad de entrada/salida). Su dise&ntilde;o y avance ha variado notablemente desde su creaci&oacute;n, aumentando su eficiencia y potencia, y reduciendo aspectos como el consumo de energ&iacute;a y el costo.</p>
<p style="text-align: justify;">Una computadora puede contener m&aacute;s de una CPU (multiprocesamiento). En la actualidad, los microprocesadores est&aacute;n constituidos por un &uacute;nico circuito integrado (chip) aunque existen los procesadores multin&uacute;cleo (varias CPU en un solo circuito integrado). Un circuito integrado que contiene una CPU tambi&eacute;n puede contener los dispositivos perif&eacute;ricos, y otros componentes de un sistema inform&aacute;tico; similar a un microcontrolador (menos potente en RAM) se le denomina sistema en un chip (SoC).</p>
<p style="text-align: justify;">Los componentes de la CPU son:</p>
<ul style="text-align: justify;">
<li>Unidad aritm&eacute;tico l&oacute;gica (ALU): realiza operaciones aritm&eacute;ticas y l&oacute;gicas.</li>
<li>Unidad de control (CU): dirige el tr&aacute;fico de informaci&oacute;n entre los registros de la CPU y conecta con la ALU las instrucciones extra&iacute;das de la memoria.</li>
<li>Registros internos: no accesibles (de instrucci&oacute;n, de bus de datos y bus de direcci&oacute;n) y accesibles de uso espec&iacute;fico (contador programa, puntero pila, acumulador, flags, etc.) o de uso general.</li>
</ul>
<p><img id="contBus" style="display: block; margin-left: auto; margin-right: auto;" src="https://concepto.de/wp-content/uploads/2014/08/CPU-e1551228076500.jpg" alt="cpu" width="632" height="316" /></p>
<h3 style="text-align: justify;"><span class="subtitulo" style="background-color: #ffcc99;">3.1.2 Controlador del Bus.</span></h3>
<p style="text-align: justify;">El controlador del bus se encarga de la frecuencia de funcionamiento y las se&ntilde;ales de sincronismo, temporizaci&oacute;n y control. Est&aacute; ubicado en un chip en la placa base.</p>
<p style="text-align: justify;">El bus es la v&iacute;a a trav&eacute;s de la que se van a transmitir y recibir todas las comunicaciones, tanto internas como externas, del sistema inform&aacute;tico. El bus es solamente un dispositivo de transferencia de informaci&oacute;n entre los componentes conectados a &eacute;l, no almacena informaci&oacute;n alguna en ning&uacute;n momento. Los datos, en forma de se&ntilde;al el&eacute;ctrica, s&oacute;lo permanecen en el bus el tiempo que necesitan en recorrer la distancia entre los dos componentes implicados en la transferencia.</p>
<p><img id="e-s" style="display: block; margin-left: auto; margin-right: auto;" src="http://3.bp.blogspot.com/-GeUd8vQCmBk/VDrx4tdz1UI/AAAAAAAAADU/zhiAb8Sd8eg/s1600/bus.png" alt="buses" width="596" height="379" /></p>
<h3 style="text-align: justify;"><span class="subtitulo" style="background-color: #ffcc99;">3.1.3 Puertas de Entrada Salida E/S</span></h3>
<p style="text-align: justify;">Un puerto de E/S es un enchufe en una computadora al que se conecta un cable. El puerto conecta la CPU a un dispositivo perif&eacute;rico a trav&eacute;s de una interfaz_ de hardware o a la red a trav&eacute;s de una interfaz, de red.</p>
<p style="text-align: justify;">En otras palabras, un puerto de E/S es un punto de conexi&oacute;n que act&uacute;a como interfaz, entre la computadora y dispositivos externos como mouse, impresora, m&oacute;dem, etc. Estos son de dos tipos:</p>
<ol style="text-align: justify;">
<li>Puerto interno: conecta la placa base a dispositivos internos como unidad de disco duro, unidad de CD, m&oacute;dem interno, etc.</li>
<li>Puerto externo: conecta la placa base a dispositivos externos como m&oacute;dem, mouse, impresora, unidades flash, etc.</li>
</ol>
<ul style="text-align: justify;">
<li>Puerto serial: los puertos seriales transmiten datos secuencialmente un bit a la vez. Por lo tanto, solo necesitan un cable para transmitir 8 bits. Sin embargo, tambi&eacute;n los hace m&aacute;s lentos. Los puertos serie suelen ser conectores macho de 9 o 25 pines. Tambi&eacute;n se conocen como puertos COM (comunicaci&oacute;n) o puertos RS323C.</li>
<li>Puerto paralelo: los puertos paralelos pueden enviar o recibir 8 bits o 1 byte a la vez. Los puertos paralelos vienen en forma de pines hembra de 25 pines y se utilizan para conectar impresoras, esc&aacute;neres, unidades de disco duro externas, etc.</li>
<li>Puerto USB: USB son las siglas de Universal Serial Bus. Es el est&aacute;ndar de la industria para la conexi&oacute;n de datos digitales de corta distancia. El puerto USB es un puerto estandarizado para conectar una variedad de dispositivos como impresora, c&aacute;mara, teclado, altavoz, etc.</li>
<li>Puerto PS/2: PS/2 son las siglas de Personal System/2. Es un puerto est&aacute;ndar hembra de 6 pines que se conecta al cable mini-DIN macho. IBM introdujo PS/2 para conectar el mouse y el teclado a las computadoras personales. Este puerto ahora est&aacute; casi obsoleto, aunque algunos sistemas compatibles con IBM pueden tener este puerto.</li>
<li>Puerto de infrarrojos: el puerto de infrarrojos es un puerto que permite el intercambio inal&aacute;mbrico de datos en un radio de 10 m. Dos dispositivos que tienen puertos infrarrojos se colocan uno frente al otro para que los haces de luces infrarrojas se puedan utilizar para compartir datos.</li>
<li>Puerto Bluetooth: Bluetooth es una especificaci&oacute;n de telecomunicaciones que facilita la conexi&oacute;n inal&aacute;mbrica entre tel&eacute;fonos, computadoras y otros dispositivos digitales a trav&eacute;s de una conexi&oacute;n inal&aacute;mbrica de corto alcance. El puerto Bluetooth permite la sincronizaci&oacute;n entre dispositivos habilitados para Bluetooth.</li>
<li>Puerto FireWire: FireWire es el est&aacute;ndar de interfaz, de Apple Computer para permitir la comunicaci&oacute;n de alta velocidad mediante bus serie. Tambi&eacute;n se llama IEEE 1394 y se usa principalmente para dispositivos de audio y video como videoc&aacute;maras digitales.</li>
</ul>
<p><img id="contInt" style="display: block; margin-left: auto; margin-right: auto;" src="https://247tecno.com/wp-content/uploads/2018/05/Puertos-Jack.jpg" alt="e/s" width="827" height="419" /></p>
<h3 style="text-align: justify;"><span class="subtitulo" style="background-color: #ffcc99;">3.1.4 Controlador de Interrupciones.</span></h3>
<p style="text-align: justify;">El controlador de interrupciones es un m&oacute;dulo que tiene por funci&oacute;n gestionar las interrupciones de entrada/salida para el procesador.</p>
<p style="text-align: justify;">Esto ahorra dise&ntilde;ar l&oacute;gica y a&ntilde;adir patitas al procesador. Tambi&eacute;n proporciona flexibilidad porque permite idealmente, gestionar un n&uacute;mero ilimitado se&ntilde;ales de interrupci&oacute;n (favoreciendo la expansi&oacute;n del sistema de entrada/salida).</p>
<p style="text-align: justify;">El controlador recibe el conjunto de se&ntilde;ales de interrupci&oacute;n procedentes de los dispositivos, toma la decisi&oacute;n de cu&aacute;l es la m&aacute;s prioritaria, y env&iacute;a una &uacute;nica se&ntilde;al al procesador. La respuesta del procesador es transmitida al dispositivo y el propio controlador se encarga de depositar en el bus el vector de la interrupci&oacute;n.</p>
<p style="text-align: justify;">En un sistema basado en la familia de procesadores 8086, esta labor la realiza el chip 8259. Este chip admite hasta 8 se&ntilde;ales de interrupci&oacute;n, pero tambi&eacute;n admite ser configurado en cascada (sus entradas proceden a su vez, de otro controlador) de modo que un conjunto de controladores 8259 pueden gestionar hasta un m&aacute;ximo de 8 x 8 se&ntilde;ales de interrupci&oacute;n procedentes de otros tantos dispositivos de entrada/salida.</p>
<p><img style="display: block; margin-left: auto; margin-right: auto;" src="https://ae01.alicdn.com/kf/HTB1gnVFIXXXXXa_XFXXq6xXFXXX9/Msm82c59a-2rs-controlador-de-interrupciones-programable-nuevo-stock.jpg_Q90.jpg_.webp" width="322" height="297" /></p>
<p style="text-align: justify;"><span class="textoGral">Ciclo de reconocimiento de interrupci&oacute;n.</span></p>
<ol style="text-align: justify;">
<li>Tras la activaci&oacute;n de una l&iacute;nea IR, el controlador activa la salida INTR se&ntilde;al&aacute;ndole a la CPU la existencia de una interrupci&oacute;n activada.</li>
<li>Al recibir la se&ntilde;al, el procesador da un pulso en su salida INTA indicando que comienza un ciclo de reconocimiento de interrupci&oacute;n.</li>
<li>Al recibir el controlador el pulso por su entrada INTA comienza a arbitrar las interrupciones recibidas y selecciona la m&aacute;s prioritaria.</li>
<li>Se emite un segundo pulso por la l&iacute;nea INTA del procesador (o controlador de bus) que utiliza el controlador para depositar en el bus el vector correspondiente a la interrupci&oacute;n de mayor prioridad.</li>
<li id="dma">El procesador obtiene la direcci&oacute;n de la rutina de interrupci&oacute;n a partir de este dato y salta a ella. Almacena el registro de flags y la direcci&oacute;n de retorno, deshabilita las interrupciones y comienza a ejecutar la rutina.</li>
</ol>
<h3 style="text-align: justify;"><span class="subtitulo" style="background-color: #ffcc99;">3.1.5 Controlador de Acceso Directo a Memoria (DMA).</span></h3>
<p style="text-align: justify;">El mecanismo de acceso directo a memoria est&aacute; controlado por un chip espec&iacute;fico, el DMAC ("DMA Controller"), que permite realizar estos intercambios sin apenas intervenci&oacute;n del procesador. En los XT estaba integrado en un chip 8237A que proporcionaba 4 canales de 8 bits (puede mover solo 1 Byte cada vez); sus direcciones de puerto son 000-00Fh. Posteriormente en los AT se instalaron dos de estos integrados y las correspondientes l&iacute;neas auxiliares en el bus de control.</p>
<p style="text-align: justify;">En contra de lo que podr&iacute;a parecer, el resultado no fue disponer de 8 canales, porque el segundo controlador se colg&oacute; en &ldquo;Cascada&rdquo; de la l&iacute;nea 4 del primero. Los canales del segundo DMAC est&aacute; asignado a las direcciones 0C0-0DFh y son de 16 bits.</p>
<p style="text-align: justify;">Pueden mover 2 Bytes (de posiciones contiguas) cada vez. Cada canal tiene asignada una prioridad para el caso de recibirse simult&aacute;neamente varias peticiones (los n&uacute;meros m&aacute;s bajos tienen prioridad m&aacute;s alta).</p>
<p id="temp" style="text-align: justify;">Pueden ser utilizados por cualquier dispositivo que los necesite (suponiendo naturalmente que est&eacute; dise&ntilde;ado para soportar este modo de operaci&oacute;n). Cada sistema los asigna de forma arbitraria, pero hay algunos cuya asignaci&oacute;n es est&aacute;ndar.</p>
<h3 style="text-align: justify;"><span class="subtitulo" style="background-color: #ffcc99;">3.1.6 Circuitos de temporizaci&oacute;n.</span></h3>
<p style="text-align: justify;">El circuito electr&oacute;nico que m&aacute;s se utiliza tanto en la industria como en circuiter&iacute;a comercial, es el circuito temporizador o de retardo, dentro de la categor&iacute;a de temporizadores, cabe destacar el m&aacute;s econ&oacute;mico y tambi&eacute;n menos preciso consistente en una resistencia y un condensador, a partir de aqu&iacute; se puede contar con un sinf&iacute;n de opciones.</p>
<p style="text-align: justify;">Cuando necesitamos un temporizador, lo primero que debemos considerar es la necesidad de precisi&oacute;n en el tiempo, base muy importante para determinar los elementos que vamos a utilizar en su concepci&oacute;n y dise&ntilde;o.</p>
<p style="text-align: justify;">Un temporizador b&aacute;sicamente consiste en un elemento que se activa o desactiva despu&eacute;s de un tiempo preestablecido. De esta manera podemos determinar el par&aacute;metro relacionado con el tiempo que ha de transcurrir para que el circuito susceptible de temporizarse, se detenga o empiece a funcionar o simplemente cierre un contacto o lo abra.</p>
<p id="contCirc" style="text-align: justify;">Se encuentra en la placa base de la PC y que es capaz, de mantener una cuenta de tiempo basada en el reloj de la computadora. Puede usarse para calcular el intervalo entre dos mediciones de tiempo o para generar pausas. Este chip tiene la capacidad de realizar diferentes funciones de conteo. Es &uacute;til para medir el tiempo que dura cierto proceso o para mantener actualizadas la hora del d&iacute;a y la fecha si se deja la PC conectada y encendida.</p>
<h3 style="text-align: justify;"><span class="subtitulo"><span style="background-color: #ffcc99;">3.1.7 Circuitos de Control</span>.</span></h3>
<p style="text-align: justify;">Es una red secuencial que acepta un c&oacute;digo que define la operaci&oacute;n que se va a ejecutar y luego prosigue a trav&eacute;s de una secuencia de estados, generando una correspondiente secuencia de se&ntilde;ales control.</p>
<p id="contVid" style="text-align: justify;">Estas se&ntilde;ales de control incluyen el control de lectura-escritura y se&ntilde;ales de direcci&oacute;n de memoria v&aacute;lida en el bus de control del sistema. Otras se&ntilde;ales generadas por el controlador se conectan a la ALU y a los registros internos del procesador para regular el flujo de informaci&oacute;n en el procesador y desde los buses de direcci&oacute;n y de datos del sistema.</p>
<h3 style="text-align: justify;"><span class="subtitulo" style="background-color: #ffcc99;">3.1.8 Controladores de video</span></h3>
<p style="text-align: justify;">La tarjeta de video, (tambi&eacute;n llamada controlador de video), es un componente electr&oacute;nico requerido para generar una se&ntilde;al de video que se manda a una pantalla de video por medio de un cable. La tarjeta de video se encuentra normalmente en la placa de sistema de la computadora o en una placa de expansi&oacute;n. La tarjeta gr&aacute;fica re&uacute;ne toda la informaci&oacute;n que debe visualizarse en pantalla y act&uacute;a como interfaz, entre el procesador y el monitor; la informaci&oacute;n es enviada a &eacute;ste por la placa luego de haberla recibido a trav&eacute;s del sistema de buses.</p>
<p style="text-align: justify;">Una tarjeta gr&aacute;fica se compone, b&aacute;sicamente, de un controlador de video, de la memoria de pantalla o RAM video, y el generador de caracteres, y en la actualidad tambi&eacute;n poseen un acelerador de gr&aacute;ficos. El controlador de video va leyendo a intervalos la informaci&oacute;n almacenada en la RAM video y la transfiere al monitor en forma de se&ntilde;al de video; el n&uacute;mero de veces por segundo que el contenido de la RAM video es le&iacute;do y transmitido al monitor en forma de se&ntilde;al de video se conoce como frecuencia de refresco de la pantalla.</p>
<p style="text-align: justify;"><strong><span class="textoGral">Tipos de placas de videos.</span></strong></p>
<p style="text-align: justify;">Adaptador de Pantalla Monocromo (MDA): los primeros PC solo visualizaban textos. El MDA contaba con 4KB de memoria de video RAM que le permit&iacute;a mostrar 25 l&iacute;neas de 80 caracteres cada una con una resoluci&oacute;n de 14x9 puntos por car&aacute;cter.</p>
<p style="text-align: justify;">Tarjeta gr&aacute;fica H&eacute;rcules: con esta tarjeta se pod&iacute;a visualizar gr&aacute;ficos y textos simult&aacute;neamente. En modo texto, soportaba una resoluci&oacute;n de 80x25 puntos. En tanto que en los gr&aacute;ficos lo hac&iacute;a con 720x350 puntos, dicha tarjeta serv&iacute;a s&oacute;lo para gr&aacute;ficos de un solo color. La tarjeta H&eacute;rcules ten&iacute;a una capacidad total de 64k de memoria video RAM. Pose&iacute;a una frecuencia de refresco de la pantalla de 50HZ.</p>
<p><img style="display: block; margin-left: auto; margin-right: auto;" src="https://definicion.de/wp-content/uploads/2009/04/tarjeta-de-video.jpg" width="600" height="408" /></p>
<p style="text-align: justify;">Color Graphics Adapter (CGA): la CGA utiliza el mismo chip que la H&eacute;rcules y aporta resoluciones y colores distintos. Los tres colores primarios se combinan digitalmente formando un m&aacute;ximo de ocho colores distintos. La resoluci&oacute;n var&iacute;a considerablemente seg&uacute;n el modo de gr&aacute;ficos que se est&eacute; utilizando.</p>
<p style="text-align: justify;"><strong>La tarjeta EGA:</strong>&nbsp;Enchanced Graphics Adapter (EGA). Se trata de una tarjeta gr&aacute;fica superior a la CGA. En el modo texto ofrece una resoluci&oacute;n de 14x18 puntos y en el modo gr&aacute;fico dos resoluciones diferentes de 640x200 y 640x350 a 4 bits, lo que da como resultado una paleta de 16 colores, siempre y cuando la tarjeta est&eacute; equipada con 256KB de memoria de video RAM.</p>
<p style="text-align: justify;"><strong>La tarjeta VGA:</strong>&nbsp;la Video Graphics Adapter (VGA) signific&oacute; la aparici&oacute;n de un nuevo est&aacute;ndar del mercado. Esta tarjeta ofrece una paleta de 256 colores, dando como resultado im&aacute;genes de colores mucho m&aacute;s vivos. Las primeras VGA contaban con 256KB de memoria y solo pod&iacute;an alcanzar una resoluci&oacute;n de 320x200 puntos con la cantidad de colores mencionados anteriormente.</p>
<p style="text-align: justify;"><strong>La tarjeta SVGA:</strong>&nbsp;la tarjeta SVGA (Super Video Graphics Adapter) contiene conjuntos de chips de uso especial, y m&aacute;s memoria, lo que aumenta la cantidad de colores y la resoluci&oacute;n.</p>
<p style="text-align: justify;"><strong>El acelerador gr&aacute;fico:</strong>&nbsp;el acelerador gr&aacute;fico se encarga de realizar una serie de funciones relacionadas con la presentaci&oacute;n de gr&aacute;ficos en la pantalla, que, de otro modo, tendr&iacute;a que realizar el procesador. De esta manera, le quita tareas de encima a este &uacute;ltimo, y as&iacute; se puede dedicar casi exclusivamente al proceso de datos.</p>
<p style="text-align: justify;"><strong>El coprocesador gr&aacute;fico:</strong>&nbsp;posteriormente, para lograr una mayor velocidad se comenzaron a instalar en las tarjetas de video otros circuitos especializados en el proceso de comandos gr&aacute;ficos, llamados coprocesadores gr&aacute;ficos. Se encuentran especializados en la ejecuci&oacute;n de una serie de instrucciones espec&iacute;ficas de generaci&oacute;n de gr&aacute;ficos.</p>
<p style="text-align: justify;"><strong>Aceleradores gr&aacute;ficos 3D:</strong>&nbsp;los gr&aacute;ficos en tres dimensiones son una representaci&oacute;n gr&aacute;fica de una escena o un objeto a lo largo de tres ejes de referencia, X, Y, Z, que marcan el ancho, el alto y la profundidad de ese gr&aacute;fico. Para manejar un gr&aacute;fico tridimensional, &eacute;ste se divide en una serie de puntos o v&eacute;rtices, en forma de coordenadas, que se almacenan en la memoria RAM.</p>
<h2 style="text-align: justify;">3.2 Aplicaciones</h2>
<h3><span style="background-color: #ffcc99;">3.2.1 Entrada salida</span></h3>
<p style="text-align: justify;">En inform&aacute;tica, un perif&eacute;rico de entrada/salida o E/S (en ingl&eacute;s: input/output o I/O) es aquel tipo de dispositivo perif&eacute;rico de un computador capaz de interactuar con los elementos externos a ese sistema de forma bidireccional, es decir, que permite tanto que sea ingresada informaci&oacute;n desde un sistema externo, como emitir informaci&oacute;n a partir de ese sistema. Los Dispositivos Perif&eacute;ricos de entrada son todos aquellos dispositivos que permiten introducir datos o informaci&oacute;n en una computadora para que esta los procese u ordene.</p>
<p style="text-align: justify;"><strong><span class="textoGral">Funciones.</span></strong></p>
<p style="text-align: justify;">Un perif&eacute;rico de E/S es el que se utiliza para ingresar (E) datos a la computadora, y luego de ser procesados por la unidad central de procesamiento (CPU), genera la salida (S) de informaci&oacute;n. Su funci&oacute;n es leer o grabar, permanente o virtualmente, todo aquello que se haga con la computadora, para que pueda ser utilizado por los usuarios u otros sistemas.</p>
<p><span style="background-color: #ffcc99;"><img style="display: block; margin-left: auto; margin-right: auto;" src="https://sites.google.com/site/eohalogicadeprogramacionii/_/rsrc/1509171373729/3---dispositivos-de-entrada-y-salida/CLfbbgpWwAAN-o0.png?height=300&amp;width=400" width="423" height="317" /></span></p>
<p style="text-align: justify;"><strong><span class="textoGral">Tipos.</span></strong></p>
<p style="text-align: justify;">Dispositivos o perif&eacute;ricos de comunicaci&oacute;n entre computadoras, tales como m&oacute;dems y tarjetas de red, por lo general sirven para entrada y salida. Tambi&eacute;n, los dispositivos de almacenamiento de datos, como los discos r&iacute;gidos, la unidad de estado s&oacute;lido, las memorias flash, las disqueteras, entre otros, se pueden considerar perif&eacute;ricos de entrada/salida.</p>
<p style="text-align: justify;"><strong>Ejemplos:</strong></p>
<ul style="text-align: justify;">
<li>Multit&aacute;ctil.</li>
<li>Casco virtual.</li>
<li>Impresora multifunci&oacute;n.</li>
</ul>
<p style="text-align: justify;"><strong><span class="textoGral">Almacenamiento de datos.</span></strong></p>
<p style="text-align: justify;">En ocasiones, se consideran perif&eacute;ricos de E/S a los dispositivos de almacenamiento de datos, por ejemplo, las lectograbadoras de discos &oacute;pticos, 'lectoras' de tarjetas de memoria, discos duros port&aacute;tiles o externos, memorias USB o memorias flash, etc&eacute;tera.</p>
<p style="text-align: justify;"><strong><span class="textoGral">Dispositivos de redes.</span></strong></p>
<p id="almacen" style="text-align: justify;">Tambi&eacute;n, los dispositivos de redes o de comunicaci&oacute;n, suelen considerarse perif&eacute;ricos de E/S porque su funci&oacute;n es la interacci&oacute;n o interconexi&oacute;n entre dos o m&aacute;s computadoras, o entre la computadora y otro perif&eacute;rico externo. Ejemplos: m&oacute;dem, tarjeta de red, concentrador, conmutador (dispositivo de red), enrutador, comunicaci&oacute;n inal&aacute;mbrica, bluetooth.</p>
<h3 style="text-align: justify;"><span class="subtitulo" style="background-color: #ffcc99;">3.2.2 Almacenamiento.</span></h3>
<p style="text-align: justify;">Conforme la tecnolog&iacute;a avanza, m&aacute;s datos se van generando, por lo que es necesario contar con un almacenamiento eficiente para poder guardar toda esa informaci&oacute;n y acceder a ellos. El almacenamiento de datos ha cambiado mucho, desde los sistemas de disco, que muy probablemente se sigan utilizando, pero de una forma m&aacute;s digital: hoy se encuentran conectados a una red y son definidos por un software.</p>
<p style="text-align: justify;">El almacenamiento de datos tiene un proceso a trav&eacute;s del uso de la tecnolog&iacute;a, &eacute;sta se aplica para organizar, distribuir y archivar informaci&oacute;n con los bytes y los bits que son parte de los sistemas de los que la gente depende d&iacute;a con d&iacute;a, llega a ser tan importante en todos los servicios: desde una simple aplicaci&oacute;n, contenido multimedia, direcciones, contactos, hasta protocolos de red y todo lo que tiene que ver con el mundo digital.</p>
<p style="text-align: justify;"><strong><span class="textoGral">Memoria contra almacenamiento.</span></strong></p>
<p style="text-align: justify;">Generalmente, los usuarios de computadoras tienden a confundir los t&eacute;rminos &ldquo;memoria&rdquo; y &ldquo;almacenamiento&rdquo; pues los emplean de manera indistinta, utiliz&aacute;ndolos para referirse a la RAM (o memoria principal) o al disco duro. Desde el punto de vista t&eacute;cnico, ambos t&eacute;rminos son pr&aacute;cticamente iguales pues tanto la RAM como el disco duro se utilizan para almacenar informaci&oacute;n, claro est&aacute;, de formas distintas y para prop&oacute;sitos diferentes.</p>
<p style="text-align: justify;">Mientras la memoria se refiere a la ubicaci&oacute;n de los datos a corto plazo, el almacenamiento es el componente de su computadora que le permite almacenar y acceder a datos a largo plazo. Usualmente, el almacenamiento se da en forma de una unidad de estado s&oacute;lido o un disco duro. El almacenamiento le permite acceder y almacenar sus aplicaciones, sistema operativo y archivos por un tiempo indefinido.</p>
<p style="text-align: justify;">Una diferencia importante entre memoria y almacenamiento es que la primera se borra cuando se apaga la computadora. Por otro lado, el almacenamiento permanece intacto no importa cu&aacute;ntas veces se apague la computadora.</p>
<p style="text-align: justify;">Por lo tanto, en la analog&iacute;a del escritorio y el archivador, cualquier archivo que quede en su escritorio cuando salga de la oficina se botar&aacute;. Todo lo que est&eacute; en su archivador se mantendr&aacute; igual.</p>
<p style="text-align: justify;"><strong><span class="textoGral">Almacenamiento en sistemas inform&aacute;ticos.</span></strong></p>
<p style="text-align: justify;">Un dispositivo de almacenamiento es un hardware que se utiliza principalmente para almacenar datos. Cada computadora de escritorio, computadora port&aacute;til, tablet y smartphone tendr&aacute;n alg&uacute;n tipo de dispositivo de almacenamiento en su interior y tambi&eacute;n puedes obtener unidades de almacenamiento externo independientes que se pueden utilizar en varios dispositivos.</p>
<ul style="text-align: justify;">
<li>Unidades de discos duros (HDD).</li>
<li>Discos de estado s&oacute;lido (SSD).</li>
</ul>
<p style="text-align: justify;"><strong><span class="textoGral">Dispositivos de almacenamiento externo.</span></strong></p>
<p style="text-align: justify;">Adem&aacute;s de los medios de almacenamiento contenidos en una computadora, tambi&eacute;n hay dispositivos de almacenamiento digital que son externos a las computadoras. Se utilizan com&uacute;nmente para ampliar la capacidad de almacenamiento cuando una computadora se queda sin espacio, para permitir una mayor portabilidad y para facilitar la transferencia de archivos de un dispositivo a otro.</p>
<ul style="text-align: justify;">
<li>Unidades de discos duros y discos de estado s&oacute;lido externos.</li>
<li>Dispositivos de memoria flash (unidades USB y tarjetas SD).</li>
<li>Dispositivos de almacenamiento &oacute;ptico (CD, DVD y discos Blu-Ray).</li>
<li>Disquetes.</li>
</ul>
<p><span style="background-color: #ffcc99;"><img style="display: block; margin-left: auto; margin-right: auto;" src="https://enlaescuela.elnortedecastilla.es/2019/img/noticias/2019/11/5dd7c42fbd237__550x550.jpg" width="418" height="252" /></span></p>
<p style="text-align: justify;"><strong><span class="textoGral">Almacenamiento en la nube.</span></strong></p>
<p style="text-align: justify;">Aunque no es exactamente un dispositivo en s&iacute; mismo, el almacenamiento en la nube es el tipo de almacenamiento m&aacute;s nuevo y vers&aacute;til para las computadoras. &ldquo;La nube&rdquo; no es un lugar u objeto, sino un enorme conjunto de servidores alojados en centros de datos de todo el mundo. Cuando guardas un documento en la nube, lo est&aacute;s almacenando en estos servidores.</p>
<p id="fuente" style="text-align: justify;">Debido a que todo se almacena en l&iacute;nea, el almacenamiento en la nube no utiliza ning&uacute;n almacenamiento secundario de la computadora, lo que te permite ahorrar espacio.</p>
<p><img style="display: block; margin-left: auto; margin-right: auto;" src="https://www.profesionalreview.com/wp-content/uploads/2020/02/Almacenamiento-en-la-nube-portada.jpg" alt="" width="687" height="523" /></p>
<h3 style="text-align: justify;"><span class="subtitulo" style="background-color: #ffcc99;">3.2.3 Fuentes de Alimentaci&oacute;n.</span></h3>
<p style="text-align: justify;">Una fuente de alimentaci&oacute;n es un componente esencial de cualquier dispositivo electr&oacute;nico ya que es ella quien se encarga de darle vida. En cualquier equipo, por peque&ntilde;o que sea, siempre hay una fuente de alimentaci&oacute;n, aunque no la veamos.</p>
<p style="text-align: justify;">En los ordenadores de sobremesa, la fuente de alimentaci&oacute;n se encuentra generalmente en la parte inferior de la torre (en cajas antiguas se encuentra en la superior), y muchas cajas de ordenador optan por incorporar un compartimento para separarla del resto y ya de paso ocultar todos los cables salientes de ella.</p>
<p style="text-align: justify;">Existen fuentes de alimentaci&oacute;n modulares y semi-modulares, de manera que los cables son total o completamente desmontables. De esta manera, una fuente de alimentaci&oacute;n modular mejora el flujo de aire del PC ya que solo cuenta con los cables que se necesitan.</p>
<p style="text-align: justify;">Una fuente de alimentaci&oacute;n sirve para dar energ&iacute;a a un dispositivo electr&oacute;nico. Siguiendo con el tema de los ordenadores de sobremesa, la fuente de alimentaci&oacute;n da energ&iacute;a a la placa base, CPU, tarjetas gr&aacute;ficas, HDDs, SSDs, ventiladores, lectores de CDs. En resumen, alimenta a todo lo que necesite energ&iacute;a, para ello hace uso de diferentes tipos de cables.</p>
<p style="text-align: justify;">Un cable de 24 pines ATX es el que va a la placa base, para la CPU podemos encontrar cables de hasta 8+8 pines (se conocen como conectores de 12 V EPS) y para las tarjetas gr&aacute;ficas se utilizan conectores PCIe en configuraciones de hasta 8+8+8+8 para las gr&aacute;ficas m&aacute;s potentes, aunque habitualmente se usan 2 o 3 de ellos &uacute;nicamente. Con las NVIDIA RTX 30 Founders Edition, el fabricante ha habilitado un nuevo conector molex de 12 pines, pero traen el correspondiente adaptador as&iacute; que no hay problemas de incompatibilidad.</p>
<p><span style="background-color: #ffcc99;"><img style="display: block; margin-left: auto; margin-right: auto;" src="http://3.bp.blogspot.com/-NwEPFPg2Qbc/UVh9BbSIEeI/AAAAAAAAHRk/-Ww9LolUegI/s1600/Fuente+ATX.jpg" width="560" height="369" /></span></p>
<p style="text-align: justify;">Las fuentes de alimentaci&oacute;n proporcionan energ&iacute;a a los SSD y HDD mediante conectores SATA de energ&iacute;a, y a los ventiladores mediante conectores molex de 3 o 4 pines o bien mediante la propia placa base (que es alimentada con el conector de 24 pines ATX). De esta manera, todos los componentes reciben energ&iacute;a de la fuente de alimentaci&oacute;n. Adem&aacute;s, las fuentes protegen a todos los componentes mediante una gran cantidad de sistemas dedicados a ello.</p>
<p style="text-align: justify;">Existen fuentes de alimentaci&oacute;n que no requieren de ventilaci&oacute;n, por lo que su refrigeraci&oacute;n es completamente pasiva. Estos modelos suelen ser fuentes de medio-bajo voltaje con una alta eficiencia, para que el calor generado sea menor y se pueda llevar a cabo su disipaci&oacute;n sin usar ni un solo ventilador acoplado a la fuente, con los que existan en la caja ser&aacute;n m&aacute;s que suficiente.</p>
<h2>3.3 Ambientes de servicio</h2>
<p id="negocio" style="text-align: justify;">El negocio de proveer servicios de datos es mucho m&aacute;s complejo que la forma en la que se dan los tradicionales servicios, los primeros requieren de nuevos conocimientos y modelos de negocio, que con frecuencia se termina involucrando o necesitando la colaboraci&oacute;n de terceras empresas. Por lo que se hace necesario que los operadores tradicionales transformen su negocio para ofrecer los servicios de datos con los niveles de servicio que el mercado exige.</p>
<h3 style="text-align: justify;"><span class="subtitulo" style="background-color: #ffcc99;">3.3.1 Negocios.</span></h3>
<p id="industria" style="text-align: justify;">Definitivamente, la tecnolog&iacute;a en general ha sido la causa principal y la acci&oacute;n m&aacute;s directa para la transformaci&oacute;n del trabajo de las organizaciones en la posguerra del siglo XX. Tanto los bienes de capital "duros" (computadores, tel&eacute;fonos, videos, facs&iacute;miles, grabadoras, etc.), como los programas y sistemas de informaci&oacute;n y comunicaci&oacute;n en general, han incrementado enormemente la productividad y eficiencia de las organizaciones. Tenemos como ejemplos los siguientes: bases de datos en redes de todo orden y topolog&iacute;a, sistemas de reservaciones en aerol&iacute;neas, sistemas de contabilidad y n&oacute;minas, archivos cl&iacute;nicos en centros de salud, sistemas de conmutaci&oacute;n electr&oacute;nica y un sin n&uacute;mero de otras aplicaciones a procesos administrativos.</p>
<h3 style="text-align: justify;"><span class="subtitulo" style="background-color: #ffcc99;">3.3.2 Industria.</span></h3>
<p style="text-align: justify;">La industrializaci&oacute;n de los servicios de tecnolog&iacute;a de informaci&oacute;n va a redefinir el mercado en t&eacute;rminos de como las organizaciones eval&uacute;an, compran y seleccionan los servicios y como los vendedores desarrollan y establecen precios de los servicios.</p>
<p style="text-align: justify;">Para lograr esta estandarizaci&oacute;n, se requiere un enfoque hacia las soluciones gen&eacute;ricas y esto debe ser responsabilidad de los proveedores, que deben de desarrollar, operar y administrar el resultado de estos gen&eacute;ricos de TI.</p>
<p style="text-align: justify;">Aunque los servicios de TI est&aacute;n en proceso de madurez, la madurez de la industria se ha incrementado en aspectos evidentes, como la forma en que los servicios son implementados y administrados.</p>
<p><img style="display: block; margin-left: auto; margin-right: auto;" src="https://statics.eleconomista.com.ar/2020/01/614e1ab9355e8.jpg" alt="" width="589" height="483" /></p>
<h3 style="text-align: justify;"><span class="subtitulo"><span style="background-color: #ffcc99;">3.3.3 Comercio Electr&oacute;nico.</span></span></h3>
<p style="text-align: justify;">El desarrollo de estas tecnolog&iacute;as y de las telecomunicaciones ha hecho que los intercambios de datos crezcan a niveles extraordinarios, simplific&aacute;ndose cada vez m&aacute;s y creando nuevas formas de comercio, y en este marco se desarrolla el Comercio Electr&oacute;nico.</p>
<p style="text-align: justify;">Se considera &ldquo;Comercio Electr&oacute;nico&rdquo; al conjunto de aquellas transacciones comerciales y financieras realizadas a trav&eacute;s del procesamiento y la transmisi&oacute;n de informaci&oacute;n, incluyendo texto, sonido e imagen.</p>
<p><img style="display: block; margin-left: auto; margin-right: auto;" src="https://www.actualidadecommerce.com/wp-content/uploads/2020/01/network-2402637_1280-830x467.jpg" alt="" width="594" height="334" /></p>
<p>&nbsp;</p>

<h2 style="text-align: center;"><em><strong><span class="textoClaro">Instituto Tecnol&oacute;gico de Saltillo<br /></span><span class="textoPeque&ntilde;o">Blvd. Venustiano Carranza #2400, Col. Tecnol&oacute;gico, Saltillo, Coahuila, M&eacute;xico C.P. 25280.<br />Contacto Email: contacto@tecnm.mx.<br />Tel&eacute;fono: 844 4020840.</span></strong></em></h2>
<h2 style="text-align: center;"><a href="https://www.facebook.com/TecNMcampusSaltillo/"><img src="https://upload.wikimedia.org/wikipedia/commons/thumb/c/cd/Facebook_logo_%28square%29.png/800px-Facebook_logo_%28square%29.png" width="80px" height="80px" /></a> <a href="http://its.mx">
 <img
href="https://www.youtube.com/channel/UCf4pqcU7cOI8emhhoeYoVVw"><img src="https://seeklogo.com/images/Y/youtube-2017-icon-logo-D1FE045118-seeklogo.com.png" width="110px" height="80px" /></a> 
  
  <img
href="https://twitter.com/TecNM_MX"><img src="https://static.vecteezy.com/system/resources/previews/002/534/045/original/social-media-twitter-logo-blue-isolated-free-vector.jpg" width="100px" height="90px" /></a> 
  
 <a href="http://its.mx"><img
src="https://w7.pngwing.com/pngs/428/279/png-transparent-computer-icons-web-page-identity-angle-text-logo.png" width="85px" height="85px" /></a> <br /><img src="https://www.tijuana.tecnm.mx/wp-content/uploads/2017/08/Tecnologico-Nacional-de-Mexico-1568x757.jpg" alt="tecnm" width="131" height="64" /></h2>